import type { ManualCardProps } from "./components/manual-card";

export const manualText: ManualCardProps[] = [
  {
    title: "このアプリについて",
    text: "このアプリは、イベント会場を周りながら「パレット」を集めて、写真の完成を目指すアプリです。\n従来のスタンプラリーとは違った、リアルタイムに変化が起こる新しい体験を提供します。",
  },
  {
    title: "パレットの集め方",
    text: "イベント会場を回っていると、「パレット」がアプリを使用している他の参加者と交換されることがあります。\n一つの場所に滞在するより会場を回った方がより多くの「パレット」を集めることができます。\n\n また、イベント会場に設置された「スポット」についている QR コードを読み取ることでも「パレット」を集めることができます。\n同じ「スポット」の QR コードから短時間に何度も「パレット」を集めることはできません。イベント会場を回って「パレット」を集めてみましょう！",
  },
  {
    title: "写真について",
    text: "イベントごとに特別な写真が用意されています。「パレット」を集めると、これらの写真に色がついていきやがて完成します。\n完全に色がつき、完成した写真は自由にダウンロードすることができます。\n\nまた、イベント会場に「フォトスポット」が設営されている場合は、「フォトスポット」であなたのためのオリジナルの写真を撮影することができます。\nフォトスポットでは撮影を行うイベント運営者の指示に従い、アプリ内から表示できる QR コードの提示にご協力ください。",
  },
  {
    title: "ボーナスについて",
    text: "イベント中、アプリから「ボーナスが発生している」という旨の通知を受け取ることがあります。\n通知に記載された場所に行くと、「パレット」を通常より多く集めることができます。人が多く集まることで、ボーナスの効果も大きくなるかもしれません。積極的に参加してみましょう！",
  },
];
